<!DOCTYPE html>
<html lang="en" dir="auto">

<head><meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no">
<meta name="robots" content="index, follow">
<title>关于CmRegisterCallback的检测/windows进程隐藏的问题 | L0x1c&#39;s Blog</title>
<meta name="keywords" content="">
<meta name="description" content="初步分析 分析到一个E语言的外挂, 但是说的是过检测的外挂, 分析一下, 直接ida一把梭大概看到有用的信息, 内部测试3-A.exe explorer.exe 打开外挂后看到的功能大概有这几个, 加载过检, 开始过检, 伪装进程, 隐藏进程这几个, 大概就能猜到肯定用到了驱动 跑起来后, 第一个功能是开始过检测, 发现修改了R3层的应用层访问的状态为拒绝 直接打开process explorer, 可以发现进程的Protection属性变成了PsProtectedSignerWinTcb-Light, 这里的保护和今年的腾讯游戏安全初赛的那个是一样的PPL 直接windbg看一下进程的EPROCESS结构, 可以看到Protection为0x61 -&gt; 0110 0001b, 可以看到修改的为PsProtectedTypeProtectedLight,PsProtectedSignerWinTcb
//进程保护类型 typedef enum _PS_PROTECTED_TYPE { PsProtectedTypeNone = 0, PsProtectedTypeProtectedLight = 1, PsProtectedTypeProtected = 2 } PS_PROTECTED_TYPE, *PPS_PROTECTED_TYPE; //Audit 审计标志（很少使用） //Signer 签名了进程 typedef enum _PS_PROTECTED_SIGNER { PsProtectedSignerNone = 0, PsProtectedSignerAuthenticode, PsProtectedSignerCodeGen, PsProtectedSignerAntimalware, PsProtectedSignerLsa, PsProtectedSignerWindows, PsProtectedSignerWinTcb, PsProtectedSignerWinSystem, PsProtectedSignerApp, PsProtectedSignerMax } PS_PROTECTED_SIGNER, *PPS_PROTECTED_SIGNER; 直接把这个位置修改为0即可

    Image: A.exe

PROCESS ffffc081cd7634c0
    SessionId: none  Cid: 0208    Peb: 843a07b000  ParentCid: 0004
    DirBase: 136b7b002  ObjectTable: ffff9d8e1f3768c0  HandleCount:  53.
    Image: smss.exe
</code></pre><p><img loading="lazy" src="image-19.png" alt="alt text"  />

<img loading="lazy" src="image-18.png" alt="alt text"  />

因为<code>smss.exe</code>的<code>EPROCESS</code>他获取了后, 可以拿到该进程的保护属性和父进程的<code>pid</code>, 第二个操作就是交换了父进程的<code>pid</code>, 可以看到<code>InheritedFromUniqueProcessId</code>等于了<code>4</code>
<img loading="lazy" src="image-20.png" alt="alt text"  />

取消就是<code>explorer.exe</code>的<code>ParentCid</code>和<code>Protection</code>赋值给了该被保护的程序
<img loading="lazy" src="image-21.png" alt="alt text"  />
</p>
<h2 id="伪装进程按钮">伪装进程按钮<a hidden class="anchor" aria-hidden="true" href="#伪装进程按钮">#</a></h2>
<p>获取自身和另一个进程的名字, 把名字复制到被保护的进程里
<img loading="lazy" src="image-23.png" alt="alt text"  />

<img loading="lazy" src="image-22.png" alt="alt text"  />

可以看到名字已经被修改成了<code>explorer.exe</code>
<img loading="lazy" src="image-24.png" alt="alt text"  />

主要这个模块处理了很多<code>peb</code>里的信息这里省略一下有点多, <code>github</code>有一个比较好的项目很像这个模块<code>https://github.com/zhuhuibeishadiao/PathModification</code></p>
<p><img loading="lazy" src="image-26.png" alt="alt text"  />
</p>
<h2 id="进程隐藏按钮">进程隐藏按钮<a hidden class="anchor" aria-hidden="true" href="#进程隐藏按钮">#</a></h2>
<p>发现比较有趣的事情, 好像<code>ydark</code>还是可以扫描到这个被隐藏的进程, 但是任务管理器的没了
<img loading="lazy" src="image-27.png" alt="alt text"  />

看一下他是怎么做的, 他直接把<code>+0x2e8 UniqueProcessId  : (null)</code>清空了, 所以任务管理器看不见
<img loading="lazy" src="image-29.png" alt="alt text"  />

<img loading="lazy" src="image-28.png" alt="alt text"  />

但是<code>ydark</code>为什么能看见, 研究了一下是通过句柄表来做的进程的遍历, 可以使用<code>PspCidTable</code>来做这个事情</p>
<h2 id="遍历pspcidtable枚举进程">遍历PspCidTable枚举进程<a hidden class="anchor" aria-hidden="true" href="#遍历pspcidtable枚举进程">#</a></h2>
<p><code>PspCidTable</code>这个位置需要通过特征码匹配来看一下是什么值
<img loading="lazy" src="image-31.png" alt="alt text"  />

<img loading="lazy" src="image-30.png" alt="alt text"  />

通过<code>PsLookupProcessByProcessId</code>的<code>E8 call</code>获取到地址后, 直接<code>dq</code>看一下, 这里大概说一下思路和找寻的方法, 代码就不贴了
<img loading="lazy" src="image-33.png" alt="alt text"  />

<code>dq pspcidtable</code>获取了表的地址后, 实际上的类型是<code>_HANDLE_TABLE</code>类型, 可以看到<code>tablecode</code>的低两位代表句柄表的层数, 最多有三层
<img loading="lazy" src="image-34.png" alt="alt text"  />

随便进一个看一下, 可以看到是加密的情况
<img loading="lazy" src="image-35.png" alt="alt text"  />

<code>win10</code>的解密是<code>&gt;&gt; 0x10 &amp; 0xfffffffffffffff0</code>
<img loading="lazy" src="image-36.png" alt="alt text"  />

解密后看一下<code>EPROCESS</code>, 发现是第一个的<code>system</code>
<img loading="lazy" src="image-37.png" alt="alt text"  />

通过这个就可以遍历出<code>id</code>和对应的<code>object</code>, 但是如果要遍历进程的, 还要进行筛选需要知道一个东西叫做<code>OBJECT_TYPE</code>和<code>OBJECT_HEADER</code>, 实际上<code>OBJECT_HEADER</code>是在<code>EPROCESS</code>结构上面的</p>
<pre tabindex="0"><code>kd&gt; dt _OBJECT_HEADER
nt!_OBJECT_HEADER
   +0x000 PointerCount     : Int8B
   +0x008 HandleCount      : Int8B
   +0x008 NextToFree       : Ptr64 Void
   +0x010 Lock             : _EX_PUSH_LOCK
   +0x018 TypeIndex        : UChar
   +0x019 TraceFlags       : UChar
   +0x019 DbgRefTrace      : Pos 0, 1 Bit
   +0x019 DbgTracePermanent : Pos 1, 1 Bit
   +0x01a InfoMask         : UChar
   +0x01b Flags            : UChar
   +0x01b NewObject        : Pos 0, 1 Bit
   +0x01b KernelObject     : Pos 1, 1 Bit
   +0x01b KernelOnlyAccess : Pos 2, 1 Bit
   +0x01b ExclusiveObject  : Pos 3, 1 Bit
   +0x01b PermanentObject  : Pos 4, 1 Bit
   +0x01b DefaultSecurityQuota : Pos 5, 1 Bit
   +0x01b SingleHandleEntry : Pos 6, 1 Bit
   +0x01b DeletedInline    : Pos 7, 1 Bit
   +0x01c Reserved         : Uint4B
   +0x020 ObjectCreateInfo : Ptr64 _OBJECT_CREATE_INFORMATION
   +0x020 QuotaBlockCharged : Ptr64 Void
   +0x028 SecurityDescriptor : Ptr64 Void
   +0x030 Body             : _QUAD
</code></pre><p>那么<code>windbg</code>看一下这个结构, 判断类型主要的还是这个TypeIndex
<img loading="lazy" src="image-38.png" alt="alt text"  />

这里的解密可以看一下<code>ObGetObjectType</code>
<img loading="lazy" src="image-39.png" alt="alt text"  />

那么实际上的解密就是<code>0xfa ^ 0x8f ^ 0x72 = 0x7</code>
<img loading="lazy" src="image-40.png" alt="alt text"  />

按照这个思路写的代码效果如下:
<img loading="lazy" src="image-32.png" alt="alt text"  />
</p>


  </div>

  <footer class="post-footer">
    <ul class="post-tags">
    </ul>
<nav class="paginav">
  <a class="prev" href="https://l0x1c.com/posts/d3ctf_writeup/">
    <span class="title">« Prev</span>
    <br>
    <span>D3CTF-WriteUp</span>
  </a>
</nav>

  </footer>
</article>
    </main>
    
<footer class="footer">
        <span>© <a href="https://github.com/adityatelange/hugo-PaperMod/graphs/contributors">PaperMod Contributors</a></span> · 

    <span>
        Powered by
